OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1708.h
#define MCLC1OUT                CLCDATAbits.MCLC1OUT            // bit 0
#define MCLC2OUT                CLCDATAbits.MCLC2OUT            // bit 1
#define MCLC3OUT                CLCDATAbits.MCLC3OUT            // bit 2

#define C1SYNC                  CM1CON0bits.C1SYNC              // bit 0
#define C1HYS                   CM1CON0bits.C1HYS               // bit 1
#define C1SP                    CM1CON0bits.C1SP                // bit 2
#define C1ZLF                   CM1CON0bits.C1ZLF               // bit 3
#define C1POL                   CM1CON0bits.C1POL               // bit 4
#define C1OUT                   CM1CON0bits.C1OUT               // bit 6
#define C1ON                    CM1CON0bits.C1ON                // bit 7

#define C1NCH0                  CM1CON1bits.C1NCH0              // bit 0
#define C1NCH1                  CM1CON1bits.C1NCH1              // bit 1
#define C1NCH2                  CM1CON1bits.C1NCH2              // bit 2
#define C1PCH0                  CM1CON1bits.C1PCH0              // bit 3
#define C1PCH1                  CM1CON1bits.C1PCH1              // bit 4
#define C1PCH2                  CM1CON1bits.C1PCH2              // bit 5
#define C1INTN                  CM1CON1bits.C1INTN              // bit 6
#define C1INTP                  CM1CON1bits.C1INTP              // bit 7

#define C2SYNC                  CM2CON0bits.C2SYNC              // bit 0
#define C2HYS                   CM2CON0bits.C2HYS               // bit 1
#define C2SP                    CM2CON0bits.C2SP                // bit 2
#define C2ZLF                   CM2CON0bits.C2ZLF               // bit 3
#define C2POL                   CM2CON0bits.C2POL               // bit 4
#define C2OUT                   CM2CON0bits.C2OUT               // bit 6
#define C2ON                    CM2CON0bits.C2ON                // bit 7

#define C2NCH0                  CM2CON1bits.C2NCH0              // bit 0
#define C2NCH1                  CM2CON1bits.C2NCH1              // bit 1
#define C2NCH2                  CM2CON1bits.C2NCH2              // bit 2
#define C2PCH0                  CM2CON1bits.C2PCH0              // bit 3
#define C2PCH1                  CM2CON1bits.C2PCH1              // bit 4
#define C2PCH2                  CM2CON1bits.C2PCH2              // bit 5
#define C2INTN                  CM2CON1bits.C2INTN              // bit 6
#define C2INTP                  CM2CON1bits.C2INTP              // bit 7

#define MC1OUT                  CMOUTbits.MC1OUT                // bit 0
#define MC2OUT                  CMOUTbits.MC2OUT                // bit 1

#define G1ASDAC0                COG1ASD0bits.G1ASDAC0           // bit 2
#define G1ASDAC1                COG1ASD0bits.G1ASDAC1           // bit 3
#define G1ASDBD0                COG1ASD0bits.G1ASDBD0           // bit 4
#define G1ASDBD1                COG1ASD0bits.G1ASDBD1           // bit 5
#define G1ARSEN                 COG1ASD0bits.G1ARSEN            // bit 6
#define G1ASE                   COG1ASD0bits.G1ASE              // bit 7

#define G1AS0E                  COG1ASD1bits.G1AS0E             // bit 0
#define G1AS1E                  COG1ASD1bits.G1AS1E             // bit 1
#define G1AS2E                  COG1ASD1bits.G1AS2E             // bit 2
#define G1AS3E                  COG1ASD1bits.G1AS3E             // bit 3

#define G1BLKF0                 COG1BLKFbits.G1BLKF0            // bit 0
#define G1BLKF1                 COG1BLKFbits.G1BLKF1            // bit 1
#define G1BLKF2                 COG1BLKFbits.G1BLKF2            // bit 2
#define G1BLKF3                 COG1BLKFbits.G1BLKF3            // bit 3
#define G1BLKF4                 COG1BLKFbits.G1BLKF4            // bit 4
#define G1BLKF5                 COG1BLKFbits.G1BLKF5            // bit 5

#define G1BLKR0                 COG1BLKRbits.G1BLKR0            // bit 0
#define G1BLKR1                 COG1BLKRbits.G1BLKR1            // bit 1
#define G1BLKR2                 COG1BLKRbits.G1BLKR2            // bit 2
#define G1BLKR3                 COG1BLKRbits.G1BLKR3            // bit 3
#define G1BLKR4                 COG1BLKRbits.G1BLKR4            // bit 4
#define G1BLKR5                 COG1BLKRbits.G1BLKR5            // bit 5

#define G1MD0                   COG1CON0bits.G1MD0              // bit 0
#define G1MD1                   COG1CON0bits.G1MD1              // bit 1
#define G1MD2                   COG1CON0bits.G1MD2              // bit 2
#define G1CS0                   COG1CON0bits.G1CS0              // bit 3
#define G1CS1                   COG1CON0bits.G1CS1              // bit 4
#define G1LD                    COG1CON0bits.G1LD               // bit 6
#define G1EN                    COG1CON0bits.G1EN               // bit 7

#define G1POLA                  COG1CON1bits.G1POLA             // bit 0
#define G1POLB                  COG1CON1bits.G1POLB             // bit 1
#define G1POLC                  COG1CON1bits.G1POLC             // bit 2
#define G1POLD                  COG1CON1bits.G1POLD             // bit 3
#define G1FDBS                  COG1CON1bits.G1FDBS             // bit 6
#define G1RDBS                  COG1CON1bits.G1RDBS             // bit 7

#define G1DBF0                  COG1DBFbits.G1DBF0              // bit 0
#define G1DBF1                  COG1DBFbits.G1DBF1              // bit 1
#define G1DBF2                  COG1DBFbits.G1DBF2              // bit 2
#define G1DBF3                  COG1DBFbits.G1DBF3              // bit 3
#define G1DBF4                  COG1DBFbits.G1DBF4              // bit 4
#define G1DBF5                  COG1DBFbits.G1DBF5              // bit 5

#define G1DBR0                  COG1DBRbits.G1DBR0              // bit 0
#define G1DBR1                  COG1DBRbits.G1DBR1              // bit 1
#define G1DBR2                  COG1DBRbits.G1DBR2              // bit 2
#define G1DBR3                  COG1DBRbits.G1DBR3              // bit 3
#define G1DBR4                  COG1DBRbits.G1DBR4              // bit 4
#define G1DBR5                  COG1DBRbits.G1DBR5              // bit 5

#define G1FIS0                  COG1FISbits.G1FIS0              // bit 0
#define G1FIS1                  COG1FISbits.G1FIS1              // bit 1
#define G1FIS2                  COG1FISbits.G1FIS2              // bit 2
#define G1FIS3                  COG1FISbits.G1FIS3              // bit 3
#define G1FIS4                  COG1FISbits.G1FIS4              // bit 4
#define G1FIS5                  COG1FISbits.G1FIS5              // bit 5
#define G1FIS6                  COG1FISbits.G1FIS6              // bit 6

#define G1FSIM0                 COG1FSIMbits.G1FSIM0            // bit 0
#define G1FSIM1                 COG1FSIMbits.G1FSIM1            // bit 1
#define G1FSIM2                 COG1FSIMbits.G1FSIM2            // bit 2
#define G1FSIM3                 COG1FSIMbits.G1FSIM3            // bit 3
#define G1FSIM4                 COG1FSIMbits.G1FSIM4            // bit 4
#define G1FSIM5                 COG1FSIMbits.G1FSIM5            // bit 5
#define G1FSIM6                 COG1FSIMbits.G1FSIM6            // bit 6

